QuickSort/index.org
# -*- mode: org -*-
#+DATE: 2016-02-15
#+TITLE: Quick Sort
#+AUTHOR: Prabhaker Mateti
#+DESCRIPTION: Software Engineering
#+HTML_LINK_UP: ../index.html
#+HTML_LINK_HOME: ../../
#+HTML_HEAD: <style> P {text-align: justify} code, pre {color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-html-preamble-format (("en" "<a href=\"../../\"> ../../</a>"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2016 %e &bull; <a href=\"http://www.wright.edu/~pmateti\"> www.wright.edu/~pmateti</a>  %d"))
#+STARTUP:showeverything
#+OPTIONS: toc:2

* Background

** History

1. Quicksort was contributed by Hoare in 1962. Hundreds of subsequent
   papers!

2. Over the decades of teaching, we "know" that only a few students
   understand Quicksort.  Why?  Bad teaching? Poor student?

** Optimal Sorting

2. For an array of size n, the best we can do is O(n lg n).
   Quicksort and Heapsort are both O(n lg n).

1. Our interest is not in the perf analysis.  Nor in the performance
   itself.

** Relevance to SE

1. This is a good example to extrapolate to Software Engineering
   issues.

** Specs

1. Signature: Quicksort(lo, hi).  

1. Array to be sorted: A[] of integers.  Low index 1, high index n.
   Global.  Quicksort(1, n). n >= 1.

1. Notation: A[lo .. hi] stands for the set of elements A[lo], .., A[hi].

1. Pre:: true;; 

1. Post::
   1. hi >= lo and sorted(A, lo, hi) and permuted(A.old, A, lo, hi),
      *or*
   2. hi < lo and A[] is unchanged, i.e., equal(A.old, A, lo, hi).

* Partitioning Idea

1. [[../Examples/QuickSort/QuickSort.ppt]] Collection of slides from a
   lecture.  Goes deep.  Understand the first few slides.

1. Quicksort(lo, hi). Focus only on A[lo] .. A[hi].  Assume hi >= lo.
   Leave other elements of A[] untouched.

2. Pick a value z := A[x], lo >= x >= hi.  (The choice of z has an
   impact on performance.)

3. Permute the elements of A[] so that any A[lo .. p] <= z < any A[p+1
   .. hi].
   1. permuted(A.old, A, lo, hi),
   2. p may equal lo - 1 (so A[lo .. p] is empty),
   2. p may equal hi (so A[p+1 .. hi] is empty),

4. Quizz: At the end of the above, is A[x] equal to z?

4. Then do 
   1. Quicksort(1, p)
   2. Quicksort(p+1, n)

5. All of this is elegantly discussed in (cite) [Foley and Hoare 1971].

* A Few Implementations

1. http://algs4.cs.princeton.edu/lectures/23Quicksort.pdf From the
   book by Sedgewick and Wayne.  [Professor Sedgewick did a PhD Thesis
   titled QuickSort.  He was the chair of Princeton U, CS department.
   His advisor was Donald Knuth, a Turing Award winner.]

1. http://gauss.ececs.uc.edu/Courses/C321/html/quicksort.java.html
   From U of Cincinnati.
1. [[../Examples/QuickSort/QuickSort-Java-distinct-ints.html]] For this
   program, input must be a list of distinct integers.  {pm: Calling an
   external representation of an array a list is sloppy.  Also, a
   sorting algorithm must not expect distinct intengers.}

1. [[../Examples/QuickSort/QuickSort-Java-Vogella.html]] Vogella is a
   respectable tutorial site.  Had this been in C/ C++, we would have
   run this code through Frama-C.

1. [[../Examples/QuickSort/doc/]] Doxygen tool-generated documentation.


* Exercise

1. Exercise: Suppose we give you the primitive operation: exchange(i,
   j) that excahnges the i-th element of the array with the j-th
   element.  If we use this op exclusively, the permutation property
   is guaranteed.  Rewrite Quicksort using exchange().  No array[x]
   := e assignments are permitted.

* Proof of QuickSort

1. https://github.com/mzp/frama-c-sample/blob/master/libc/stdlib/qsort.c
   QuickSort written for frama-c.

* References

1. Foley, Michael, and Charles Antony Richard Hoare. "Proof of a
   Recursive Program: Quicksort." The Computer Journal 14.4 (1971):
   391-395.  Required Reading.

1. Sedgewick, R. Quicksort,  Ph. D. Dissertation, Advisor: Donald Knuth,
   Computer Science Dept., Stanford University (May 1975) Report
   STAN-CS-75-492, 1975.  Reference.

1. Sedgewick, Robert, and Jon Bentley. "Quicksort is Optimal."
   Knuthfest, Stanford University, Stanford
   (2002). https://www.cs.princeton.edu/~rs/talks/QuicksortIsOptimal.pdf
   Recommended Reading.

1. http://algs4.cs.princeton.edu/lectures/23Quicksort.pdf From the
   book by Sedgewick and Wayne.  [Professor Sedgewick did a PhD Thesis
   titled QuickSort.  He was the chair of Princeton U, CS department.
   His advisor was Donald Knuth, a Turing Award winner.]

1. Mateti, Prabhaker. "A Decision Procedure for the Correctness of a
   Class of Programs." Journal of the ACM (JACM) 28.2 (1981): 215-232.
   {About a class of sorting programs.} Reference.

1. https://github.com/mzp/frama-c-sample/blob/master/libc/stdlib/qsort.c
   QuickSort written for frama-c.

1. [[../Examples/QuickSort/quicksort.ppt]] Collection of slides from a
   lecture.  Goes deep.  Understand the first few slides.

* End
# Local variables:
# after-save-hook: org-html-export-to-html
# end:
