QuickSort/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-08-07 Mon 10:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Quick Sort</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Quick Sort</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2f44594">1. Background</a>
<ul>
<li><a href="#org691254e">1.1. History</a></li>
<li><a href="#orgf5fc192">1.2. Optimal Sorting</a></li>
<li><a href="#org29c8aad">1.3. Relevance to SE</a></li>
<li><a href="#orgaa85109">1.4. Specs</a></li>
</ul>
</li>
<li><a href="#org3de5656">2. Partitioning Idea</a></li>
<li><a href="#org249b729">3. A Few Implementations</a></li>
<li><a href="#org8a31a10">4. Exercise</a></li>
<li><a href="#org71f8240">5. Proof of QuickSort</a></li>
<li><a href="#org00f590d">6. References</a></li>
<li><a href="#org64894d3">7. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2f44594" class="outline-2">
<h2 id="org2f44594"><span class="section-number-2">1</span> Background</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org691254e" class="outline-3">
<h3 id="org691254e"><span class="section-number-3">1.1</span> History</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Quicksort was contributed by Hoare in 1962. Hundreds of subsequent
papers!</li>

<li>Over the decades of teaching, we "know" that only a few students
understand Quicksort.  Why?  Bad teaching? Poor student?</li>
</ol>
</div>
</div>

<div id="outline-container-orgf5fc192" class="outline-3">
<h3 id="orgf5fc192"><span class="section-number-3">1.2</span> Optimal Sorting</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>For an array of size n, the best we can do is O(n lg n).
Quicksort and Heapsort are both O(n lg n).</li>

<li>Our interest is not in the perf analysis.  Nor in the performance
itself.</li>
</ol>
</div>
</div>

<div id="outline-container-org29c8aad" class="outline-3">
<h3 id="org29c8aad"><span class="section-number-3">1.3</span> Relevance to SE</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>This is a good example to extrapolate to Software Engineering
issues.</li>
</ol>
</div>
</div>

<div id="outline-container-orgaa85109" class="outline-3">
<h3 id="orgaa85109"><span class="section-number-3">1.4</span> Specs</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>Signature: Quicksort(lo, hi).</li>

<li>Array to be sorted: A[] of integers.  Low index 1, high index n.
Global.  Quicksort(1, n). n &gt;= 1.</li>

<li>Notation: A[lo .. hi] stands for the set of elements A[lo], .., A[hi].</li>

<li>Pre:: true;;</li>

<li>Post::
<ol class="org-ol">
<li>hi &gt;= lo and sorted(A, lo, hi) and permuted(A.old, A, lo, hi),
<b>or</b></li>
<li>hi &lt; lo and A[] is unchanged, i.e., equal(A.old, A, lo, hi).</li>
</ol></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org3de5656" class="outline-2">
<h2 id="org3de5656"><span class="section-number-2">2</span> Partitioning Idea</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="../Examples/QuickSort/QuickSort.ppt">../Examples/QuickSort/QuickSort.ppt</a> Collection of slides from a
lecture.  Goes deep.  Understand the first few slides.</li>

<li>Quicksort(lo, hi). Focus only on A[lo] .. A[hi].  Assume hi &gt;= lo.
Leave other elements of A[] untouched.</li>

<li>Pick a value z := A[x], lo &gt;= x &gt;= hi.  (The choice of z has an
impact on performance.)</li>

<li>Permute the elements of A[] so that any A[lo .. p] &lt;= z &lt; any A[p+1
.. hi].
<ol class="org-ol">
<li>permuted(A.old, A, lo, hi),</li>
<li>p may equal lo - 1 (so A[lo .. p] is empty),</li>
<li>p may equal hi (so A[p+1 .. hi] is empty),</li>
</ol></li>

<li>Quizz: At the end of the above, is A[x] equal to z?</li>

<li>Then do 
<ol class="org-ol">
<li>Quicksort(1, p)</li>
<li>Quicksort(p+1, n)</li>
</ol></li>

<li>All of this is elegantly discussed in (cite) [Foley and Hoare 1971].</li>
</ol>
</div>
</div>

<div id="outline-container-org249b729" class="outline-2">
<h2 id="org249b729"><span class="section-number-2">3</span> A Few Implementations</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="http://algs4.cs.princeton.edu/lectures/23Quicksort.pdf">http://algs4.cs.princeton.edu/lectures/23Quicksort.pdf</a> From the
book by Sedgewick and Wayne.  [Professor Sedgewick did a PhD Thesis
titled QuickSort.  He was the chair of Princeton U, CS department.
His advisor was Donald Knuth, a Turing Award winner.]</li>

<li><a href="http://gauss.ececs.uc.edu/Courses/C321/html/quicksort.java.html">http://gauss.ececs.uc.edu/Courses/C321/html/quicksort.java.html</a>
From U of Cincinnati.</li>
<li><a href="../Examples/QuickSort/QuickSort-Java-distinct-ints.html">../Examples/QuickSort/QuickSort-Java-distinct-ints.html</a> For this
program, input must be a list of distinct integers.  {pm: Calling an
external representation of an array a list is sloppy.  Also, a
sorting algorithm must not expect distinct intengers.}</li>

<li><a href="../Examples/QuickSort/QuickSort-Java-Vogella.html">../Examples/QuickSort/QuickSort-Java-Vogella.html</a> Vogella is a
respectable tutorial site.  Had this been in C/ C++, we would have
run this code through Frama-C.</li>

<li><a href="../Examples/QuickSort/doc/">../Examples/QuickSort/doc/</a> Doxygen tool-generated documentation.</li>
</ol>
</div>
</div>


<div id="outline-container-org8a31a10" class="outline-2">
<h2 id="org8a31a10"><span class="section-number-2">4</span> Exercise</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Exercise: Suppose we give you the primitive operation: exchange(i,
j) that excahnges the i-th element of the array with the j-th
element.  If we use this op exclusively, the permutation property
is guaranteed.  Rewrite Quicksort using exchange().  No array[x]
:= e assignments are permitted.</li>
</ol>
</div>
</div>

<div id="outline-container-org71f8240" class="outline-2">
<h2 id="org71f8240"><span class="section-number-2">5</span> Proof of QuickSort</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="https://github.com/mzp/frama-c-sample/blob/master/libc/stdlib/qsort.c">https://github.com/mzp/frama-c-sample/blob/master/libc/stdlib/qsort.c</a>
QuickSort written for frama-c.</li>
</ol>
</div>
</div>

<div id="outline-container-org00f590d" class="outline-2">
<h2 id="org00f590d"><span class="section-number-2">6</span> References</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Foley, Michael, and Charles Antony Richard Hoare. "Proof of a
Recursive Program: Quicksort." The Computer Journal 14.4 (1971):
391-395.  Required Reading.</li>

<li>Sedgewick, R. Quicksort,  Ph. D. Dissertation, Advisor: Donald Knuth,
Computer Science Dept., Stanford University (May 1975) Report
STAN-CS-75-492, 1975.  Reference.</li>

<li>Sedgewick, Robert, and Jon Bentley. "Quicksort is Optimal."
Knuthfest, Stanford University, Stanford
(2002). <a href="https://www.cs.princeton.edu/~rs/talks/QuicksortIsOptimal.pdf">https://www.cs.princeton.edu/~rs/talks/QuicksortIsOptimal.pdf</a>
Recommended Reading.</li>

<li><a href="http://algs4.cs.princeton.edu/lectures/23Quicksort.pdf">http://algs4.cs.princeton.edu/lectures/23Quicksort.pdf</a> From the
book by Sedgewick and Wayne.  [Professor Sedgewick did a PhD Thesis
titled QuickSort.  He was the chair of Princeton U, CS department.
His advisor was Donald Knuth, a Turing Award winner.]</li>

<li>Mateti, Prabhaker. "A Decision Procedure for the Correctness of a
Class of Programs." Journal of the ACM (JACM) 28.2 (1981): 215-232.
{About a class of sorting programs.} Reference.</li>

<li><a href="https://github.com/mzp/frama-c-sample/blob/master/libc/stdlib/qsort.c">https://github.com/mzp/frama-c-sample/blob/master/libc/stdlib/qsort.c</a>
QuickSort written for frama-c.</li>

<li><a href="../Examples/QuickSort/quicksort.ppt">../Examples/QuickSort/quicksort.ppt</a> Collection of slides from a
lecture.  Goes deep.  Understand the first few slides.</li>
</ol>
</div>
</div>

<div id="outline-container-org64894d3" class="outline-2">
<h2 id="org64894d3"><span class="section-number-2">7</span> End</h2>
<div class="outline-text-2" id="text-7">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-02-15
</div>
</body>
</html>
